# Contains Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategoryNameMap..::..Contains Method
CategoryNameMap Class See Also
---
Tests for the existence of a category with that name within the map.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	string key
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	key As String _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	String^ key
)
```

# ### Parameters
key
    Type: System..::..StringThe category name to be searched for.
# ### Return Value
The Contains method returns True if the name is within the map, otherwise False.
# See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace